import React from 'react';

export default function Careers() {
  return (
    <React.Fragment>
      <div className='page-bg-wrap' id='careers-bg'>
        <div className='page-header-wrap'>
          <h1>Карьера</h1>
        </div>
      </div>
      <div className='page-content'>
        <div className='page-content-grid' id='careers-grid'>
          <div className='page-maintext'>
            <h2>Изменим мир вместе</h2>
            <p>
              Мы — семья с общими ценностями и видением. 
              Мы стремимся к получению результатов и обеспечению отличного обслуживания клиентов, 
              которое приносит душевное спокойствие нашим клиентам. 
              Для всех нас здесь основополагающим принципом является то, что рабочее место должно быть захватывающим местом; 
              местом, где люди счастливы и могут постоянно развиваться. Вот почему наши обязательства перед командой заключаются в следующем:
            </p>
            <ul>
              <li>Поддерживать комфортным рабочее место;</li>
              <li>Сохранять семейную атмосферу по мере роста;</li>
              <li>Делать работу интересной;</li>
              <li>Предоставлять возможности для личного и профессионального роста людей;</li>
              <li>Продвигать по карьерной лестнице и вознаграждать.</li>
            </ul>
            <p>
              В нашем коллективе все играют ключевую роль, все равны и каждый вносит свой вклад. 
              Мы ищем людей, разделяющих наши ценности, и стремимся внушать доверие во всех их взаимодействиях. 
              Мы ищем людей, которым недостаточно обычного, людей, жаждущих перемен и совершенства.
            </p>
            <h2>Присоединяйтесь к нам</h2>
            <p>
              Если Вы заинтересованы в том, чтобы присоединиться к нам в качестве юриста, стажера, в наш бухгалтерский или административный отдел, 
              просто отправьте нам электронное письмо. Мы свяжемся с Вами в ближайшее время.
            </p>
          </div>
        </div>
      </div>
    </React.Fragment>
  );
}