import React from 'react';
import Form from '../Form';
import { Link } from 'react-router-dom';
import justice from '../../../img/litigation/justice.webp';
import partner from '../../../img/home/lawyers/demidov-aleksandr.webp';

export default function Litigation() {
  return (
    <React.Fragment>
      <div className='page-bg-wrap' id='litigation-bg'>
        <div className='page-header-wrap'>
          <h1>Судебные споры на Кипре</h1>
        </div>
      </div>
      <div className='page-content'>
        <div className='page-content-grid'>
          <div className='page-maintext'>
            <h2>Большой опыт разрешения сложных споров.</h2>
            <p>
              Иногда люди сталкиваются с судебным разбирательством или не имеют другого выбора, кроме обращения в суд. 
              Подобные ситуации вызывают стресс и неуверенность. Мы помогаем нашим клиентов решить их самые сложные проблемы, 
              умело управляя их спорами и ведя сложные судебные и арбитражные дела.
            </p>
            <p>
              Мы неоднократно получали по всему миру судебные запреты на замораживание многомиллионных коммерческих, 
              корпоративных и трастовых дел и регулярно разрешаем споры в нескольких юрисдикциях. 
              Мы гордимся нашим аналитическим, стратегическим и надежным подходом к самым сложным случаям, что отличает нас от конкурентов.
            </p>
            <img src={justice} alt='img'/>
          </div>
          <div className='page-form-wrap'>
            <Form/>
          </div>
          <div className='page-partner-grid'>
            <div className='page-avatar-wrap'>
              <img src={partner} alt='img'/>
            </div>
            <div className='quote'>
              <p>
                Требуется больше, чем хорошее знание закона; речь идет о том, 
                как справляться с рисками, понимать границы возможного и то, 
                чем действительно рискуют наши клиенты, помогая им принимать наилучшие решения.
                <br/>
                <em>Александ Демидов - Управляющий партнер.</em>
              </p>
            </div>
          </div>
          <div className='page-about-grid two-items'>
            <div className='first'>
              <h4>
                <svg viewBox='0 0 512 512'>
                  <path d='M466.5 83.7l-192-80a48.15 48.15 0 0 0-36.9 0l-192 80C27.7 91.1 16 108.6 16 128c0 198.5 114.5 335.7 221.5 380.3 11.8 4.9 25.1 4.9 36.9 0C360.1 472.6 496 349.3 496 128c0-19.4-11.7-36.9-29.5-44.3zM256.1 446.3l-.1-381 175.9 73.3c-3.3 151.4-82.1 261.1-175.8 307.7z'/>
                </svg>
                Почему мы
              </h4>
              <p>
                <svg viewBox='0 0 256 512'>
                  <path d='M224.3 273l-136 136c-9.4 9.4-24.6 9.4-33.9 0l-22.6-22.6c-9.4-9.4-9.4-24.6 0-33.9l96.4-96.4-96.4-96.4c-9.4-9.4-9.4-24.6 0-33.9L54.3 103c9.4-9.4 24.6-9.4 33.9 0l136 136c9.5 9.4 9.5 24.6.1 34z'/>
                </svg>
                Плавный процесс - спокойствие
              </p>
              <p>
                <svg viewBox='0 0 256 512'>
                  <path d='M224.3 273l-136 136c-9.4 9.4-24.6 9.4-33.9 0l-22.6-22.6c-9.4-9.4-9.4-24.6 0-33.9l96.4-96.4-96.4-96.4c-9.4-9.4-9.4-24.6 0-33.9L54.3 103c9.4-9.4 24.6-9.4 33.9 0l136 136c9.5 9.4 9.5 24.6.1 34z'/>
                </svg>
                Твердые расценки
              </p>
              <p>
                <svg viewBox='0 0 256 512'>
                  <path d='M224.3 273l-136 136c-9.4 9.4-24.6 9.4-33.9 0l-22.6-22.6c-9.4-9.4-9.4-24.6 0-33.9l96.4-96.4-96.4-96.4c-9.4-9.4-9.4-24.6 0-33.9L54.3 103c9.4-9.4 24.6-9.4 33.9 0l136 136c9.5 9.4 9.5 24.6.1 34z'/>
                </svg>
                Знаете что и когда ожидать
              </p>
              <p>
                <svg viewBox='0 0 256 512'>
                  <path d='M224.3 273l-136 136c-9.4 9.4-24.6 9.4-33.9 0l-22.6-22.6c-9.4-9.4-9.4-24.6 0-33.9l96.4-96.4-96.4-96.4c-9.4-9.4-9.4-24.6 0-33.9L54.3 103c9.4-9.4 24.6-9.4 33.9 0l136 136c9.5 9.4 9.5 24.6.1 34z'/>
                </svg>
                Поддержка шаг за шагом
              </p>
            </div>
            <div className='second'>
              <h4>
                <svg viewBox='0 0 512 512'>
                  <path d='m510.08 250.107-53.479-73.333c-1.883-2.582-4.886-4.108-8.08-4.108h-220.339l41.89-57.441c2.561-3.511 2.561-8.273 0-11.784l-53.48-73.333c-1.882-2.582-4.885-4.108-8.08-4.108h-198.512c-5.523 0-10 4.477-10 10v440c0 5.523 4.477 10 10 10h348.517c3.194 0 6.197-1.526 8.08-4.108l53.479-73.334c2.56-3.511 2.56-8.273 0-11.784l-41.89-57.441h70.334c3.195 0 6.197-1.526 8.08-4.108l53.479-73.333c2.56-3.511 2.56-8.274.001-11.785zm-490.08-204.108h183.428l46.187 63.333-46.187 63.333h-183.428zm423.437 273.334h-203.434c-5.523 0-10 4.477-10 10s4.477 10 10 10h113.431l46.186 63.333-46.187 63.334h-333.433v-126.667h130.002c5.523 0 10-4.477 10-10s-4.477-10-10-10h-130.002v-126.667h423.437l46.186 63.333z'/>
                  <path d='m85.002 367.666c-19.299 0-35 15.701-35 35s15.701 35 35 35 35-15.701 35-35-15.701-35-35-35zm0 50c-8.271 0-15-6.729-15-15s6.729-15 15-15 15 6.729 15 15-6.729 15-15 15z'/>
                  <path d='m324.501 412.667h-174.498c-5.523 0-10 4.477-10 10s4.477 10 10 10h174.499c5.522 0 10-4.477 10-10s-4.478-10-10.001-10z'/>
                  <path d='m140.003 382.665c0 5.523 4.477 10 10 10h174.499c5.522 0 10-4.477 10-10s-4.478-10-10-10h-174.499c-5.523 0-10 4.477-10 10z'/>
                  <path d='m85.002 220.999c-19.299 0-35 15.701-35 35s15.701 35 35 35 35-15.701 35-35-15.701-35-35-35zm0 50c-8.271 0-15-6.729-15-15s6.729-15 15-15 15 6.729 15 15-6.729 15-15 15z'/>
                  <path d='m411.997 266h-261.994c-5.523 0-10 4.477-10 10s4.477 10 10 10h261.994c5.522 0 10-4.477 10-10s-4.478-10-10-10z'/>
                  <path d='m411.997 225.999h-261.994c-5.523 0-10 4.477-10 10s4.477 10 10 10h261.994c5.522 0 10-4.477 10-10s-4.478-10-10-10z'/>
                  <path d='m85.002 144.333c19.299 0 35-15.701 35-35s-15.701-35-35-35-35 15.701-35 35 15.701 35 35 35zm0-50.001c8.271 0 15 6.729 15 15s-6.729 15-15 15-15-6.729-15-15 6.729-15 15-15z'/>
                  <path d='m150.003 139.334h36.499c5.523 0 10-4.477 10-10s-4.477-10-10-10h-36.499c-5.523 0-10 4.477-10 10s4.477 10 10 10z'/>
                  <path d='m150.003 99.332h36.499c5.523 0 10-4.477 10-10s-4.477-10-10-10h-36.499c-5.523 0-10 4.477-10 10s4.477 10 10 10z'/>
                  <path d='m205.006 329.333c0-5.523-4.477-10-10-10h-.007c-5.523 0-9.996 4.477-9.996 10s4.48 10 10.003 10 10-4.477 10-10z'/>
                </svg>
                Что мы делаем
              </h4>
              <p>
                <svg viewBox='0 0 256 512'>
                  <path d='M224.3 273l-136 136c-9.4 9.4-24.6 9.4-33.9 0l-22.6-22.6c-9.4-9.4-9.4-24.6 0-33.9l96.4-96.4-96.4-96.4c-9.4-9.4-9.4-24.6 0-33.9L54.3 103c9.4-9.4 24.6-9.4 33.9 0l136 136c9.5 9.4 9.5 24.6.1 34z'/>
                </svg>
                Судебные споры
              </p>
              <p>
                <svg viewBox='0 0 256 512'>
                  <path d='M224.3 273l-136 136c-9.4 9.4-24.6 9.4-33.9 0l-22.6-22.6c-9.4-9.4-9.4-24.6 0-33.9l96.4-96.4-96.4-96.4c-9.4-9.4-9.4-24.6 0-33.9L54.3 103c9.4-9.4 24.6-9.4 33.9 0l136 136c9.5 9.4 9.5 24.6.1 34z'/>
                </svg>
                Арбитражные споры
              </p>
              <p>
                <svg viewBox='0 0 256 512'>
                  <path d='M224.3 273l-136 136c-9.4 9.4-24.6 9.4-33.9 0l-22.6-22.6c-9.4-9.4-9.4-24.6 0-33.9l96.4-96.4-96.4-96.4c-9.4-9.4-9.4-24.6 0-33.9L54.3 103c9.4-9.4 24.6-9.4 33.9 0l136 136c9.5 9.4 9.5 24.6.1 34z'/>
                </svg>
                Судебные запреты
              </p>
              <p>
                <svg viewBox='0 0 256 512'>
                  <path d='M224.3 273l-136 136c-9.4 9.4-24.6 9.4-33.9 0l-22.6-22.6c-9.4-9.4-9.4-24.6 0-33.9l96.4-96.4-96.4-96.4c-9.4-9.4-9.4-24.6 0-33.9L54.3 103c9.4-9.4 24.6-9.4 33.9 0l136 136c9.5 9.4 9.5 24.6.1 34z'/>
                </svg>
                ...и многое другое!
              </p>
            </div>
          </div>
          <div className='contact-us'>
            <h2>Свяжитесь с нами для детальной консультации.</h2>
            <Link to='/contact'>Связаться с нами</Link>
          </div>
        </div>
      </div>
    </React.Fragment>
  );
}