import React from 'react';

export default function SocialResponsibility() {
  return (
    <React.Fragment>
      <div className='page-bg-wrap' id='sr-bg'>
        <div className='page-header-wrap'>
          <h1>Общественная ответственность</h1>
        </div>
      </div>
      <div className='page-content'>
        <div className='page-content-grid' id='sr-grid'>
          <div className='page-maintext'>
            <h2>
              Мы считаем, что предприятия и компании несут большую ответственность перед обществом. 
              Они являются средством, с помощью которого мы можем улучшить мир и жизнь людей.
            </h2>
            <p>
              Будучи ориентированной на ценности компанией людей, делающих правильные вещи, 
              мы прилагаем постоянные усилия в области благотворительности, изменения окружающей среды, 
              безвозмездной работы, спорта и равных возможностей.
            </p>
            <p>
              Кроме того, мы верим в то, что делаем хороших людей лучше и помогаем им влиять на окружающих, вызывая системные изменения. 
              Наша рабочая среда — это безопасное и счастливое рабочее место, где каждый ценится независимо от различий. 
              Каждый поощряется следовать своим увлечениям и поддерживается в развитии как профессионал, так и как человек.
            </p>
            <p>
              Мы делаем то, что видим вселенским долгом: сделать этот мир лучше, чем он был, когда мы его нашли.
            </p>
          </div>
        </div>
      </div>
    </React.Fragment>
  );
}